# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

num_dict = {
    1: "a", 2: "b", 3: "c", 4: "d", 5: "e", 6: "f", 7: "g", 8: "h", 9: "i", 10: "g", 11: "k", 12: "l", 13: "m", 14: "n",
    15: "o", 16: "p", 17: "q", 18: "r", 19: "s", 20: "t", 21: "u", 22: "v", 23: "w", 24: "x", 25: "y", 26: "z"
}

position = int(input("Введите номер буквы английского алфавита (от 1 до 26): "))
if (position >= 1) and (position <= 26):
    print("Буква под номером {} - {}".format(position, num_dict.get(position)))
else:
    print("Введенное число не соответсвует букве из английского алфавита")