# 4. Написать программу, которая генерирует в указанных пользователем границах:
# случайное целое число;
# случайное вещественное число;
# случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если надо
# получить случайный символ от 'a' до 'f', то вводятся эти символы. Программа должна вывести на экран любой
# символ алфавита от 'a' до 'f' включительно.


import random


print("Генерация целого числа")
left_border = int(input("Введите левую границу: "))
right_border = int(input("Введите правую границу: "))

a = random.randint(left_border, right_border)
print(a)

print("Генерация вещественного числа")
left_border = int(input("Введите левую границу: "))
right_border = int(input("Введите правую границу: "))

b = random.randint(left_border, right_border - 1) + (random.randint(0, 1000) / 1000)
print(b)

letter_dict = {
    "a": 1, "b": 2, "c": 3, "d": 4, "e": 5, "f": 6, "g": 7, "h": 8, "i": 9, "j": 10, "k": 11, "l": 12, "m": 13, "n": 14,
    "o": 15, "p": 16, "q": 17, "r": 18, "s": 19, "t": 20, "u": 21, "v": 22, "w": 23, "x": 24, "y": 25, "z": 26
}

num_dict = {
    1: "a", 2: "b", 3: "c", 4: "d", 5: "e", 6: "f", 7: "g", 8: "h", 9: "i", 10: "g", 11: "k", 12: "l", 13: "m", 14: "n",
    15: "o", 16: "p", 17: "q", 18: "r", 19: "s", 20: "t", 21: "u", 22: "v", 23: "w", 24: "x", 25: "y", 26: "z"
}

print("Генерация буквы: ")
left_border = input("Введите левую границу(букву английского алфавита в нижнем регистре): ")
right_border = input("Введите правую границу(букву английского алфавита в нижнем регистре): ")

left_border = letter_dict.get(left_border)
right_border = letter_dict.get(right_border)

c = num_dict.get(random.randint(left_border, right_border))

print(c)